In [4]:
# define a dictionary
import pandas as pd
data={
    "empid":[101,102,103,104,105],
    "ename":["Akash","Prajwal","Aarti","Akshay","Aneela"],
    "deptname":["HR","IT","Finance","HR","IT"],
    "salary":[1000,2000,2500,500,800]
}

In [6]:
# convert dict to dataframe
df = pd.DataFrame(data)

In [8]:
# write dataframe in to an excel file
df.to_excel("emoloyees.xlsx",index=False,sheet_name="EmployeesData")

In [9]:
# read from excel file
df_excel = pd.read_excel("emoloyees.xlsx",sheet_name="EmployeesData")

In [10]:
df_excel

   empid    ename deptname  salary
0    101    Akash       HR    1000
1    102  Prajwal       IT    2000
2    103    Aarti  Finance    2500
3    104   Akshay       HR     500
4    105   Aneela       IT     800

In [18]:
# write dataframe in to a json file
df.to_json("employees.json",index=False,orient='records')

In [21]:
# read from a json file
df_json = pd.read_json("employees.json")

In [20]:
# write dataframe in to a parquet file
df.to_parquet("employees.parquet",engine="pyarrow")

In [23]:
# read from a parquet file
df_parquet = pd.read_parquet("employees.parquet")

In [24]:
df_parquet

   empid    ename deptname  salary
0    101    Akash       HR    1000
1    102  Prajwal       IT    2000
2    103    Aarti  Finance    2500
3    104   Akshay       HR     500
4    105   Aneela       IT     800

In [36]:
# Database operation ( read and write )
# Define connection string
from sqlalchemy import create_engine
import cx_Oracle
mysql_conn = create_engine("mysql+pymysql://root:Admin%40143@localhost:3308/demo") 
oracledb_conn = create_engine("oracle+cx_oracle://system:admin@localhost:1521/xe")

In [28]:
# write dataframe in to mysql database table
df.to_sql("employee",mysql_conn,index=False)

5

In [31]:
# read from mysql database table
query = """select * from employee where deptname in ('HR','IT')"""
df_mysql_table = pd.read_sql(query,mysql_conn)

In [34]:
df_mysql_table

   empid    ename deptname  salary
0    101    Akash       HR    1000
1    102  Prajwal       IT    2000
2    103    Aarti  Finance    2500
3    104   Akshay       HR     500
4    105   Aneela       IT     800

In [38]:
# write dataframe in to oracle database table
df.to_sql("employee_sep",oracledb_conn,index=False)

5

In [39]:
# read from oracle database table
query = """select * from employee_sep where empid in (101,105)"""
df_oracle_table = pd.read_sql(query,oracledb_conn)

In [40]:
df_oracle_table

   empid   ename deptname  salary
0    101   Akash       HR    1000
1    105  Aneela       IT     800

In [61]:
# Assume our source is an excel file and tragte is mysql database , check if all the row from source to target is loaded correctly

# Read the data from excel and store in a df
df_source = pd.read_excel("emoloyees.xlsx",sheet_name="EmployeesData")

# Read the data from mysql and store in a df
df_target= pd.read_sql("""select * from employee""",mysql_conn)
extra_in_source = ~df_source['empid'].isin(df_target['empid'])
extra_rows_in_source = df_source[extra_in_source]
extra_rows_in_source

   empid    ename deptname  salary
5    106  Prakash       IT    1000
6    107   Thomas       IT    1500

In [67]:
# I need to extract the data from oracle and mysql table and perform inner join
df_mysql= pd.read_sql("""select * from employee""",mysql_conn)
df_oracle= pd.read_sql("""select * from employee_sep""",oracledb_conn)
pd.merge(df_mysql,df_oracle,on='empid',how='left')

   empid  ename_x deptname_x  salary_x  ename_y deptname_y  salary_y
0    101    Akash         HR      1000    Akash         HR    1000.0
1    102  Prajwal         IT      2000  Prajwal         IT    2000.0
2    103    Aarti    Finance      2500    Aarti    Finance    2500.0
3    104   Akshay         HR       500   Akshay         HR     500.0
4    105   Aneela         IT       800   Aneela         IT     800.0
5    110   Thomas     Travel       400      NaN        NaN       NaN

   empid  ename_x deptname_x  salary_x  ename_y deptname_y  salary_y
0    101    Akash         HR      1000    Akash         HR      1000
1    102  Prajwal         IT      2000  Prajwal         IT      2000
2    103    Aarti    Finance      2500    Aarti    Finance      2500
3    104   Akshay         HR       500   Akshay         HR       500
4    105   Aneela         IT       800   Aneela         IT       800